"""
============================
# -*- coding: utf-8 -*-
# @Time    : 2026/1/21 21:33
# @Author  : PcLiu
# @FileName: stock_lrb_em.py
===========================
STOCK_LRB_EM
AKSHARE 东方财富-数据中心-年报季报-业绩快报-利润表
"""
from enum import StrEnum


class STOCK_LRB_EM(StrEnum):
    ID = "ID"
    季报日期 = "季报日期"
    股票代码 = "股票代码"
    股票简称 = "股票简称"
    净利润 = "净利润"
    净利润同比 = "净利润同比"
    营业总收入 = "营业总收入"
    营业总收入同比 = "营业总收入同比"
    营业总支出_营业支出 = "营业总支出_营业支出"
    营业总支出_销售费用 = "营业总支出_销售费用"
    营业总支出_管理费用 = "营业总支出_管理费用"
    营业总支出_财务费用 = "营业总支出_财务费用"
    营业总支出_营业总支出 = "营业总支出_营业总支出"
    营业利润 = "营业利润"
    利润总额 = "利润总额"
    公告日期 = "公告日期"
