"""
============================
# -*- coding: utf-8 -*-
# @Time    : 2026/1/21 21:33
# @Author  : PcLiu
# @FileName: stock_zcfz_em.py
===========================
STOCK_ZCFZ_EM
AKSHARE 东方财富-数据中心-年报季报-业绩快报-资产负债表
"""
from enum import StrEnum


class STOCK_ZCFZ_EM(StrEnum):
    ID = "ID"
    季报日期 = "季报日期"
    股票代码 = "股票代码"
    股票简称 = "股票简称"
    交易所 = "交易所"
    资产_货币资金 = "资产_货币资金"
    资产_应收账款 = "资产_应收账款"
    资产_存货 = "资产_存货"
    资产_总资产 = "资产_总资产"
    资产_总资产同比 = "资产_总资产同比"
    负债_应付账款 = "负债_应付账款"
    负债_总负债 = "负债_总负债"
    负债_预收账款 = "负债_预收账款"
    负债_总负债同比 = "负债_总负债同比"
    资产负债率 = "资产负债率"
    股东权益合计 = "股东权益合计"
    公告日期 = "公告日期"
