"""
============================
# -*- coding: utf-8 -*-
# @Time    : 2026/1/21 21:33
# @Author  : PcLiu
# @FileName: stock_xjll_em.py
===========================
STOCK_XJLL_EM
AKSHARE 东方财富-数据中心-年报季报-业绩快报-现金流量表
"""
from enum import StrEnum


class STOCK_XJLL_EM(StrEnum):
    ID = "ID"
    季报日期 = "季报日期"
    股票代码 = "股票代码"
    股票简称 = "股票简称"
    净现金流_净现金流 = "净现金流_净现金流"
    净现金流_同比增长 = "净现金流_同比增长"
    经营性现金流_现金流量净额 = "经营性现金流_现金流量净额"
    经营性现金流_净现金流占比 = "经营性现金流_净现金流占比"
    投资性现金流_现金流量净额 = "投资性现金流_现金流量净额"
    投资性现金流_净现金流占比 = "投资性现金流_净现金流占比"
    融资性现金流_现金流量净额 = "融资性现金流_现金流量净额"
    融资性现金流_净现金流占比 = "融资性现金流_净现金流占比"
    公告日期 = "公告日期"
