"""
============================
# -*- coding: utf-8 -*-
# @Time    : 2026/1/21 21:33
# @Author  : PcLiu
# @FileName: stock_yjkb_em.py
===========================
STOCK_YJKB_EM
AKSHARE 东方财富-数据中心-年报季报-业绩报表
"""
from enum import StrEnum


class STOCK_YJKB_EM(StrEnum):
    ID = "ID"
    季报日期 = "季报日期"
    股票代码 = "股票代码"
    股票简称 = "股票简称"
    每股收益 = "每股收益"
    营业收入_营业收入 = "营业收入_营业收入"
    营业收入_去年同期 = "营业收入_去年同期"
    营业收入_同比增长 = "营业收入_同比增长"
    营业收入_季度环比增长 = "营业收入_季度环比增长"
    净利润_净利润 = "净利润_净利润"
    净利润_去年同期 = "净利润_去年同期"
    净利润_同比增长 = "净利润_同比增长"
    净利润_季度环比增长 = "净利润_季度环比增长"
    每股净资产 = "每股净资产"
    净资产收益率 = "净资产收益率"
    所处行业 = "所处行业"
    公告日期 = "公告日期"
